org/physics.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: physics
#+TITLE: physics
* Curriculum
** [[file:An_approximation_to_an_efficient_fundamental_physics_curriculum.org][An approximation to an efficient fundamental physics curriculum]]
** [[file:The_Graph,_Wall,_Tome_project_of_Eric_Weinstein's_Portal_Community.org][The Graph, Wall, Tome project of Eric Weinstein's Portal Community]] which takes [[file:The_Road_to_Reality_by_Roger_Penrose_in_2004.org][The Road to Reality by Roger Penrose in 2004]] as its primary reference
* Books and lectures
** Overview
*** [[file:The_Road_to_Reality_by_Roger_Penrose_in_2004.org][The Road to Reality by Roger Penrose in 2004]]
*** [[file:Physics_from_Symmetry_by_Jakob_Schwichtenberg_in_2015.org][Physics from Symmetry by Jakob Schwichtenberg in 2015]]
** Statistical physics
*** [[file:Order_out_of_chaos_by_Prigogine_and_Stengers_in_1984.org][Order out of chaos by Prigogine and Stengers in 1984]]
*** [[file:Population_biology_and_criticality_by_Nico_Stollenwerk_and_Vincent_Johnson_in_2010.org][Population biology and criticality by Nico Stollenwerk and Vincent Johnson in 2010]]
*** [[file:Statistical_Physics_of_Complex_Systems_by_Eric_Bertin_in_2016.org][Statistical Physics of Complex Systems by Eric Bertin in 2016]]
*** [[file:Master_equations_and_the_theory_of_stochastic_path_integrals_by_Markus_Weber_and_Erwin_Frey_in_2017.org][Master equations and the theory of stochastic path integrals by Markus Weber and Erwin Frey in 2017]]
*** [[file:Introduction_to_dynamical_large_deviations_of_Markov_processes_by_Hugo_Touchette_in_2018.org][Introduction to dynamical large deviations of Markov processes by Hugo Touchette in 2018]]
*** [[file:Effective_fluctuation_and_response_theory_by_Polettini_and_Esposito_in_2018.org][Effective fluctuation and response theory by Polettini and Esposito in 2018]]
** Quantum field theory
*** [[file:Notes_on_representation_theory_and_quantum_mechanics_by_Noah_Miller_in_2018.org][Notes on representation theory and quantum mechanics by Noah Miller in 2018]]
*** [[file:Quantum_Field_Theory_for_the_Gifted_Amateur_by_Lancaster_and_Blundell_in_2014.org][Quantum Field Theory for the Gifted Amateur by Lancaster and Blundell in 2014]]
*** [[file:Gauge_Theories_in_Particle_Physics_A_Practical_Introduction_by_Aitchison_and_Hey_in_2013.org][Gauge Theories in Particle Physics A Practical Introduction by Aitchison and Hey in 2013]]
*** [[file:Quantum_mechanics_and_quantum_field_theory_by_Jonathan_Dimock_in_2011.org][Quantum mechanics and quantum field theory by Jonathan Dimock in 2011]]
*** [[file:The_Structure_and_Interpretation_of_the_Standard_Model_by_Gordon_McCabe_in_2007.org][The Structure and Interpretation of the Standard Model by Gordon McCabe in 2007]]
*** [[file:Quantum_field_theory_for_economics_and_finance_by_Belal_Baaquie_in_2018.org][Quantum field theory for economics and finance by Belal Baaquie in 2018]]
*** [[file:Introduction_to_the_Standard_Model_of_Particle_Physics_by_Rainer_Hauser_and_Alex_Flournoy_in_2019.org][Introduction to the Standard Model of Particle Physics by Rainer Hauser and Alex Flournoy in 2019]]
** [[file:conformal_field_theory.org][conformal field theory]]
** General relativity
*** [[file:Gravitation_by_Misner,_Thorne,_and_Wheeler_in_1970.org][Gravitation by Misner, Thorne, and Wheeler in 1970]]
*** [[file:What_is_a_tensor_by_XylyXylyX.org][What is a tensor? by XylyXylyX]]
*** [[file:What_is_a_manifold_by_XylyXylyX.org][What is a manifold? by XylyXylyX]]
*** [[file:What_is_general_relativity_by_XylyXylyX.org][What is general relativity? by XylyXylyX]]
*** [[file:A_thorough_introduction_to_the_theory_of_general_relativity_by_Frederic_Schuller_in_2015.org][A thorough introduction to the theory of general relativity by Frederic Schuller in 2015]]
*** [[file:A_General_Relativity_Workbook_by_Thomas_Moore_in_2010.org][A General Relativity Workbook by Thomas Moore in 2010]]
** Geometry
*** See [[file:differential_geometry.org][differential geometry]]
*** [[file:Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009.org][Catalogue of Spacetimes by Mueller and Grave in 2009]]
*** [[file:Lectures_on_Geometrical_Anatomy_of_Theoretical_Physics_by_Frederic_Schuller_in_2015.org][Lectures on Geometrical Anatomy of Theoretical Physics by Frederic Schuller in 2015]]
*** [[file:The_geometry_of_physics_by_Theodore_Frankel_in_2012.org][The geometry of physics by Theodore Frankel in 2012]]
*** [[file:Geometry,_Topology,_and_Physics_by_Mikio_Nakahara_in_2003.org][Geometry, Topology, and Physics by Mikio Nakahara in 2003]]
*** [[file:Physics_and_geometry_by_Edward_Witten_in_1986.org][Physics and geometry by Edward Witten in 1986]]
*** [[file:Geometry_of_physics_by_Urs_Schreiber.org][Geometry of physics by Urs Schreiber]]
** New theories
*** [[file:Geometric_unity_by_Eric_Weinstein_in_2013.org][Geometric unity by Eric Weinstein in 2013]]
*** [[file:Covariant_Loop_Quantum_Gravity_An_Elementary_Introduction_to_Quantum_Gravity_and_Spinfoam_Theory_by_Rovelli_and_Vidotto_in_2014.org][Covariant Loop Quantum Gravity An Elementary Introduction to Quantum Gravity and Spinfoam Theory by Rovelli and Vidotto in 2014]]
*** [[file:Higher_prequantum_geometry_by_Urs_Schreiber_in_2017.org][Higher prequantum geometry by Urs Schreiber in 2017]]
*** [[file:Wolfram_physics_project.org][Wolfram physics project]]
** [[file:philosophy.org][philosophy]]
*** [[file:String_Theory_and_the_Scientific_Method_by_Richard_Dawid_in_2013.org][String Theory and the Scientific Method by Richard Dawid in 2013]]
* Notes on specific topics
** [[file:electromagnetism.org][electromagnetism]]
** [[file:statistical_physics.org][statistical physics]]
** [[file:baryogenesis.org][baryogenesis]]
** [[file:effective_theories.org][effective theories]]
