content/posts/physics.md
+++
title = "physics"
author = ["Cameron Smith"]
lastmod = 2020-09-20T18:37:37-04:00
slug = "physics"
draft = false
+++

## Curriculum {#curriculum}


### [An approximation to an efficient fundamental physics curriculum]({{< relref "An_approximation_to_an_efficient_fundamental_physics_curriculum" >}}) {#an-approximation-to-an-efficient-fundamental-physics-curriculum--an-approximation-to-an-efficient-fundamental-physics-curriculum-dot-md}


### [The Graph, Wall, Tome project of Eric Weinstein's Portal Community]({{< relref "The_Graph,_Wall,_Tome_project_of_Eric_Weinstein's_Portal_Community" >}}) which takes [The Road to Reality by Roger Penrose in 2004]({{< relref "The_Road_to_Reality_by_Roger_Penrose_in_2004" >}}) as its primary reference {#the-graph-wall-tome-project-of-eric-weinstein-s-portal-community--the-graph-wall-tome-project-of-eric-weinstein-s-portal-community-dot-md--which-takes-the-road-to-reality-by-roger-penrose-in-2004--the-road-to-reality-by-roger-penrose-in-2004-dot-md--as-its-primary-reference}


## Books and lectures {#books-and-lectures}


### Overview {#overview}

<!--list-separator-->

-  [The Road to Reality by Roger Penrose in 2004]({{< relref "The_Road_to_Reality_by_Roger_Penrose_in_2004" >}})

<!--list-separator-->

-  [Physics from Symmetry by Jakob Schwichtenberg in 2015]({{< relref "Physics_from_Symmetry_by_Jakob_Schwichtenberg_in_2015" >}})


### Statistical physics {#statistical-physics}

<!--list-separator-->

-  [Order out of chaos by Prigogine and Stengers in 1984]({{< relref "Order_out_of_chaos_by_Prigogine_and_Stengers_in_1984" >}})

<!--list-separator-->

-  [Population biology and criticality by Nico Stollenwerk and Vincent Johnson in 2010]({{< relref "Population_biology_and_criticality_by_Nico_Stollenwerk_and_Vincent_Johnson_in_2010" >}})

<!--list-separator-->

-  [Statistical Physics of Complex Systems by Eric Bertin in 2016]({{< relref "Statistical_Physics_of_Complex_Systems_by_Eric_Bertin_in_2016" >}})

<!--list-separator-->

-  [Master equations and the theory of stochastic path integrals by Markus Weber and Erwin Frey in 2017]({{< relref "Master_equations_and_the_theory_of_stochastic_path_integrals_by_Markus_Weber_and_Erwin_Frey_in_2017" >}})

<!--list-separator-->

-  [Introduction to dynamical large deviations of Markov processes by Hugo Touchette in 2018]({{< relref "Introduction_to_dynamical_large_deviations_of_Markov_processes_by_Hugo_Touchette_in_2018" >}})

<!--list-separator-->

-  [Effective fluctuation and response theory by Polettini and Esposito in 2018]({{< relref "Effective_fluctuation_and_response_theory_by_Polettini_and_Esposito_in_2018" >}})


### Quantum field theory {#quantum-field-theory}

<!--list-separator-->

-  [Notes on representation theory and quantum mechanics by Noah Miller in 2018]({{< relref "Notes_on_representation_theory_and_quantum_mechanics_by_Noah_Miller_in_2018" >}})

<!--list-separator-->

-  [Quantum Field Theory for the Gifted Amateur by Lancaster and Blundell in 2014]({{< relref "Quantum_Field_Theory_for_the_Gifted_Amateur_by_Lancaster_and_Blundell_in_2014" >}})

<!--list-separator-->

-  [Gauge Theories in Particle Physics A Practical Introduction by Aitchison and Hey in 2013]({{< relref "Gauge_Theories_in_Particle_Physics_A_Practical_Introduction_by_Aitchison_and_Hey_in_2013" >}})

<!--list-separator-->

-  [Quantum mechanics and quantum field theory by Jonathan Dimock in 2011]({{< relref "Quantum_mechanics_and_quantum_field_theory_by_Jonathan_Dimock_in_2011" >}})

<!--list-separator-->

-  [The Structure and Interpretation of the Standard Model by Gordon McCabe in 2007]({{< relref "The_Structure_and_Interpretation_of_the_Standard_Model_by_Gordon_McCabe_in_2007" >}})

<!--list-separator-->

-  [Quantum field theory for economics and finance by Belal Baaquie in 2018]({{< relref "Quantum_field_theory_for_economics_and_finance_by_Belal_Baaquie_in_2018" >}})

<!--list-separator-->

-  [Introduction to the Standard Model of Particle Physics by Rainer Hauser and Alex Flournoy in 2019]({{< relref "Introduction_to_the_Standard_Model_of_Particle_Physics_by_Rainer_Hauser_and_Alex_Flournoy_in_2019" >}})


### [conformal field theory]({{< relref "conformal_field_theory" >}}) {#conformal-field-theory--conformal-field-theory-dot-md}


### General relativity {#general-relativity}

<!--list-separator-->

-  [Gravitation by Misner, Thorne, and Wheeler in 1970]({{< relref "Gravitation_by_Misner,_Thorne,_and_Wheeler_in_1970" >}})

<!--list-separator-->

-  [What is a tensor? by XylyXylyX]({{< relref "What_is_a_tensor_by_XylyXylyX" >}})

<!--list-separator-->

-  [What is a manifold? by XylyXylyX]({{< relref "What_is_a_manifold_by_XylyXylyX" >}})

<!--list-separator-->

-  [What is general relativity? by XylyXylyX]({{< relref "What_is_general_relativity_by_XylyXylyX" >}})

<!--list-separator-->

-  [A thorough introduction to the theory of general relativity by Frederic Schuller in 2015]({{< relref "A_thorough_introduction_to_the_theory_of_general_relativity_by_Frederic_Schuller_in_2015" >}})

<!--list-separator-->

-  [A General Relativity Workbook by Thomas Moore in 2010]({{< relref "A_General_Relativity_Workbook_by_Thomas_Moore_in_2010" >}})


### Geometry {#geometry}

<!--list-separator-->

-  See [differential geometry]({{< relref "differential_geometry" >}})

<!--list-separator-->

-  [Catalogue of Spacetimes by Mueller and Grave in 2009]({{< relref "Catalogue_of_Spacetimes_by_Mueller_and_Grave_in_2009" >}})

<!--list-separator-->

-  [Lectures on Geometrical Anatomy of Theoretical Physics by Frederic Schuller in 2015]({{< relref "Lectures_on_Geometrical_Anatomy_of_Theoretical_Physics_by_Frederic_Schuller_in_2015" >}})

<!--list-separator-->

-  [The geometry of physics by Theodore Frankel in 2012]({{< relref "The_geometry_of_physics_by_Theodore_Frankel_in_2012" >}})

<!--list-separator-->

-  [Geometry, Topology, and Physics by Mikio Nakahara in 2003]({{< relref "Geometry,_Topology,_and_Physics_by_Mikio_Nakahara_in_2003" >}})

<!--list-separator-->

-  [Physics and geometry by Edward Witten in 1986]({{< relref "Physics_and_geometry_by_Edward_Witten_in_1986" >}})

<!--list-separator-->

-  [Geometry of physics by Urs Schreiber]({{< relref "Geometry_of_physics_by_Urs_Schreiber" >}})


### New theories {#new-theories}

<!--list-separator-->

-  [Geometric unity by Eric Weinstein in 2013]({{< relref "Geometric_unity_by_Eric_Weinstein_in_2013" >}})

<!--list-separator-->

-  [Covariant Loop Quantum Gravity An Elementary Introduction to Quantum Gravity and Spinfoam Theory by Rovelli and Vidotto in 2014]({{< relref "Covariant_Loop_Quantum_Gravity_An_Elementary_Introduction_to_Quantum_Gravity_and_Spinfoam_Theory_by_Rovelli_and_Vidotto_in_2014" >}})

<!--list-separator-->

-  [Higher prequantum geometry by Urs Schreiber in 2017]({{< relref "Higher_prequantum_geometry_by_Urs_Schreiber_in_2017" >}})

<!--list-separator-->

-  [Wolfram physics project]({{< relref "Wolfram_physics_project" >}})


### [philosophy]({{< relref "philosophy" >}}) {#philosophy--philosophy-dot-md}

<!--list-separator-->

-  [String Theory and the Scientific Method by Richard Dawid in 2013]({{< relref "String_Theory_and_the_Scientific_Method_by_Richard_Dawid_in_2013" >}})


## Notes on specific topics {#notes-on-specific-topics}


### [electromagnetism]({{< relref "electromagnetism" >}}) {#electromagnetism--electromagnetism-dot-md}


### [statistical physics]({{< relref "statistical_physics" >}}) {#statistical-physics--statistical-physics-dot-md}


### [baryogenesis]({{< relref "baryogenesis" >}}) {#baryogenesis--baryogenesis-dot-md}


### [effective theories]({{< relref "effective_theories" >}}) {#effective-theories--effective-theories-dot-md}
